/*
    Player.cpp
    作成：得居勇太
*/
#include "Player.h"

//戻り値 クラス名::関数名(引数)

//////////////////////////////////////////////
//コンストラクタ							
//戻り値：なし										
//////////////////////////////////////////////
Player::Player()
{
    position_x = 5;
    position_y = 5;
}

//////////////////////////////////////////////
//デストラクタ							
//戻り値：なし										
//////////////////////////////////////////////
Player::~Player()
{

}

//////////////////////////////////////////////
//コンストラクタ							
//戻り値：なし	
//引数１：Xの初期座標
//引数２：Yの初期座標
//////////////////////////////////////////////
Player::Player(int x, int y)
{
    position_x = x;
    position_y = y;
}
//////////////////////////////////////////////
//メイン関数									
//戻り値：プレイヤーが移動したかどうか	移動した場合はtrue.していない場合はfalseを返す。	
//////////////////////////////////////////////
bool Player::Main()
{
    bool ret = false;	//戻り値用変数。

    bool through = false;  //スルー用変数
       //ベクトル用変数

    //プレイヤーの入力受付
     /*リアルタイムのキー入力*/
    if (_kbhit())	//キー入力があったら0以外になる
    {
        switch (_getch())	//入力されたキーを取得する
        {
        case 72://上
            //矢印キーの上が押されたときの処理
            vec_y = -1;
            vec_x = 0;
            ret = true;
            break;
        case 77://右
            vec_x = 1;
            vec_y = 0;
            ret = true;
            break;
        case 80://下
            vec_y = 1;
            vec_x = 0;
            ret = true;
            break;
        case 75://左
            vec_x = -1;
            vec_y = 0;
            ret = true;
            break;
        case 224:
            through = true;
            break;
        }
        if (through)return ret;

    }
    return ret;
}

//////////////////////////////////////////////
//移動関数									
//戻り値：なし								
//引数１：Xの移動量							
//引数２：Yの移動量							
//関数の詳細説明							
//////////////////////////////////////////////
void Player::Move(int x, int y)
{
    position_x += x;
    position_y += y;
}
//////////////////////////////////////////////
//HP増減関数									
//戻り値：なし								
//引数１：HPの変動量												
//////////////////////////////////////////////
void Player::Hp_change(int value)
{
    hp += value;
}
