#include "Player.h"
/*
   player.cpp
   プレイヤークラスのcppファイル
*/
//クラスの関数定義
//戻り値　クラス名::関数名（引数）


////////////////////////////////////////////
//コンストラクタ
//戻り値　無し
////////////////////////////////////////////

Player::Player()
{
	position_x = 5;
}

Player::Player(int x, int y)
{
	position_x = x;
	position_y = y;
}

Player::~Player()
{

}

////////////////////////////////////////////
//プレイヤーの移動関数
//戻り値　無し
//引数１　X座標の移動量 ,引数２　Y座標の移動量
////////////////////////////////////////////
void Player::Move(int x, int y)
{
	position_x += x;
	position_y += y;
}

////////////////////////////////////////////
//プレイヤーのHP関数
//戻り値　無し
//引数１　HPの増減量
////////////////////////////////////////////
void Player::Hp_change(int value)
{
	hp += value;
}
